# 需求：编写程序输出如下图形
#   *
#  ***
# *****
#  ***
#   *

# 思路：因为前三行的变化规律和后两行的变化规律不一致，所以分为上下两部分分别进行处理

# 写法1、while循环结合字符串的*运算符（字符串的复制）
# i = 1
#
# # 先打印上半部分
# while i <= 3:
#     # 每行中都做输出规则星号的动作
#     print(' ' * (3 - i), '*' * (2 * i - 1))
#     i += 1
#
# # 重置循环变量i
# i = 1
#
# # 再打印下半部分
# while i <= 2:
#     # 每行中都做输出规则星号的动作
#     print(' ' * i, '*' * (5 - 2 * i))
#     i += 1

# 写法2、在一行中做若干次输出星号的动作，这样的操作在多行中都这样操作，即循环的循环（循环的嵌套）
i = 1
j = 1

# 先打印上半部分
# 在三行中都如此操作
while i <= 3:
    # 在一行中按规则输出空格
    while j <= 3 - i:
        print(' ', end='')
        j += 1

    # 内层循环变量需要重置
    j = 1

    # 在一行中按规则输出星号
    while j < i * 2:
        print('*', end='')
        j += 1
    # 换行
    print()

    # 内层循环变量需要重置
    j = 1
    i += 1

# 重置循环变量i
i = 1

# 再打印下半部分
# 在两行中都如此操作
while i <= 2:
    # 在一行中按规则输出空格
    while j <= i:
        print(' ', end='')
        j += 1

    # 内层循环变量需要重置
    j = 1

    # 在一行中按规则输出星号
    while j <= 5 - i * 2:
        print('*', end='')
        j += 1
    # 换行
    print()

    # 内层循环变量需要重置
    j = 1
    i += 1

