# -------新增操作-------
dict1={}
print('新增前：{0}'.format(dict1))  # 新增前：{}
dict1['秦皇']='嬴政'
print('新增后:{0}'.format(dict1)) # 新增后:{'秦皇': '嬴政'}
# 添加相同的键、不同的值，字典中显示最后添加的键值对
dict1['秦皇']='胡亥'
print('新增后：{0}'.format(dict1)) # 新增后：{'秦皇': '胡亥'}
# 添加不同的值
dict1['汉武']='刘彻'
print('新增后：{0}'.format(dict1)) # 新增后：{'秦皇': '胡亥', '汉武': '刘彻'}

# -------修改操作--------
# 方式1：对已经存在的键，直接进行赋值
print('修改前：{0}'.format(dict1)) # 修改前：{'秦皇': '胡亥', '汉武': '刘彻'}
dict1['秦皇']='嬴政'
print('修改后：{0}'.format(dict1)) # 修改后：{'秦皇': '嬴政', '汉武': '刘彻'}
# 方式2：使用update()函数，将一个字典的内容修改为另一个字典的内容
dict2={'秦皇':'胡亥'}
print('修改前：{0}'.format(dict1)) # 修改前：{'秦皇': '嬴政', '汉武': '刘彻'}
print(id(dict1)) # 2056792972008
dict1.update(dict2)
print('修改后：{0}'.format(dict1)) # 修改后：{'秦皇': '胡亥', '汉武': '刘彻'}
print(id(dict1)) # 2056792972008

dict2={'秦皇':'嬴政','汉武':'刘彻','唐宗':'李世民'}
print('修改前：{0}'.format(dict1)) # 修改前：{'秦皇': '胡亥', '汉武': '刘彻'}
dict1.update(dict2)
print('修改后：{0}'.format(dict1)) # 修改后：{'秦皇': '嬴政', '汉武': '刘彻', '唐宗': '李世民'}

# --------删除操作--------
# popitem()函数：移除字典对象中尾部的键值对
print('删除前：{0}'.format(dict1)) # 删除前：{'秦皇': '嬴政', '汉武': '刘彻', '唐宗': '李世民'}
dict1.popitem()
print('删除后：{0}'.format(dict1)) # 删除后：{'秦皇': '嬴政', '汉武': '刘彻'}
# pop()函数：移除字典对象中指定键名的键值对
print('删除前：{0}'.format(dict1)) # 删除前：{'秦皇': '嬴政', '汉武': '刘彻'}
dict1.pop('秦皇')
print('删除后：{0}'.format(dict1)) # 删除后：{'汉武': '刘彻'}
# del 对象[键名]
print('删除前：{0}'.format(dict1)) # 删除前：{'汉武': '刘彻'}
del dict1['汉武']
print('删除后：{0}'.format(dict1)) # 删除后：{}
